app/controllers/tweets_controller.rb

  def searh
    @tweets=current_user.searcht(:hashtag)
   # if @tweet.nil?
    #  flash.now[:notice] = "Soory no tweets Found !"
     #  render "search"
     #end
      @tweet=[]
      @tweets.each do |tweet|
      if(tweet.user.location.present?)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]

  def search
    @tweets=current_user.search(tweet_params[:hashtag])
   # if @tweet.nil?
    #  flash.now[:notice] = "Soory no tweets Found !"
     #  render "search"
     #end
      @tweet=[]
      @twittertweet=[]
      @tweets.each do |tweet|
      if(tweet.user.location.present?)
          source=tweet.source.dup
          lattitude=Geocoder.search(tweet.user.location.to_s).first.coordinates.first
          longitude=Geocoder.search(tweet.user.location.to_s).first.coordinates.last
          @tweet<<
            {
              :location => tweet.user.location,
              :text => tweet.text,
              :profile_pic => tweet.user["profile_image_url"],
              :status_count => tweet.user.statuses_count,
              :friends_count => tweet.user.friends_count,
              :lat => lattitude,
              :lng => longitude,
              :Source => ActionController::Base.helpers.strip_tags(source)
            }
             @twittertweet<<
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "twittertweets" ("created_at", "friends_count", "lattitude", "location", "longitude", "profile_pic", "retweet_count", "source", "status_count", "tweet_id", "tweet_text", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"