app/controllers/twittertweets_controller.rb

SELECT "twittertweets".* FROM "twittertweets" WHERE (twittertweet.tweet_text like ~= 'hashtag')
---
  def search
  	hashtag=params[:hashtag]
  	 @tweets = Twittertweet.where('tweet_text ilike ?', '%' + hashtag + '%' )